app/views/houses/show.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."house_id" = $1  [["house_id", 1]]
---

<% @house.characters.each do |character| %>