app/controllers/characters_controller.rb

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @character = Character.find(params[:id])

INSERT INTO "characters" ("name", "photo_url", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "kjh"], ["photo_url", "lkj"], ["house_id", 1], ["created_at", 2016-08-02 17:48:42 UTC], ["updated_at", 2016-08-02 17:48:42 UTC]]
---
  def create
    @character = Character.new(character_params)

    if @character.save

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "characters" SET "photo_url" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["photo_url", "dfjaks fjdka"], ["updated_at", 2016-08-02 20:00:58 UTC], ["id", 9]]
---
  def update
    @character = Character.find(params[:id])

    if @character.update(character_params)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 8]]
---
  def destroy
    @character = Character.find(params[:id])
    @character.destroy