app/controllers/houses_controller.rb

INSERT INTO "houses" ("house_name", "map", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["house_name", "Big House"], ["map", "North"], ["created_at", 2016-08-01 19:09:47 UTC], ["updated_at", 2016-08-01 19:09:47 UTC]]
---
  def create
    @house = House.new(house_params)

    if @house.save